def num_tusk(a):
    if a == 1:
        #1
        x = {'Россия':'Москва', 'Швеция':'Стокгольм', 'Дания':'Копенгаген','Норвегия':'Осло','Германия':'Берлин'}
        y = list(x.keys())
        w = list(x.values())
        print(y,w,sep ='\n')
        #print(x.items())
        print(sorted(x.values()))
        while True:
            c = input('Введите название страны - ')
            if c == 'stop':
                break
            else:
                print(x.get(c))


    if a == 2:
        #2
        x = {'А':1, 'В':1, 'Е':1, 'И':1, 'Н':1, 'О':1, 'Р':1, 'С':1, 'Т':1, \
            'Д':2, 'К':2, 'Л':2, 'М':2, 'П':2, 'У':2, \
            'Б':3, 'Г':3, 'Ё':3, 'Ь':3, 'Я':3, \
            'Й':4, 'Ы':4, \
            'Ж':5, 'З':5, 'Х':5, 'Ц':5, 'Ч':5, \
            'Ш':8, 'Э':8, 'Ю':8, \
            'Ф':10, 'Щ':10, 'Ъ':10, }

        y = input('enter word - ').upper()
        z = tuple(y)
        w = 0

        for i in z:
            if x.get(i) == None:
                print('Слово не должно состоять из латинских букв и цифр')
                break
            else:
                w += x.get(i)
        print('стоимость слова равна - ', w)

    if a == 3:
        #3
        language = { 'st1': {'английский(uk)','шведский','китайский'},
                     'st2': {'немецкий','сербский','китайский'},
                     'st3': {'норвежский','латынь','сербский'},
                     'st4': {'иврит','индонезийский', 'английский(usa)'},
                     'st5': {'немецкий','мексиканский','китайский'} }
        # 2 сербских, немецих и китайских языка
        x = set()
        for i in language.values():
            x.update(i)
        print(x)


        y = list()
        for i in language.keys():
            j = language[i]
            for u in j:
                if u == 'китайский':
                    y.append(i)
        print(y)

while True:
    x = int(input('     Введите номер задания: '))
    if x == 0:
        break
    else:
        num_tusk(x)